[
    {
        "title": "Automatic Mechatronic Sorting System ",
        "image": "/static/images/mech458-1.jpg",
        "preview": "asdf",
        "description": "asdfasdf",
        "date": "April 2023",
        "type": "Professional",
        "carousel": [
            "/static/images/mech458-1.jpg",
            "/static/images/testing.gif"
        ],
        "id": "automatic-mechatronic-sorting-system-",
        "link": "/projects/automatic-mechatronic-sorting-system-"
    },
    {
        "title": "Underwater Acoustic Pinger V2",
        "image": "/static/images/Pinger-1.jpg",
        "preview": "An underwater acoustic pinger designed to mimic the functions of the Benthos ALP-365 with extended features for usability.",
        "description": "An underwater acoustic pinger that utilizes a piezo electric transducer to output sound waves in a specific frequency range (22KHz to 40 KHz) underwater. Integrates USB-C charging, smart battery protection, easy battery swapping with separate waterproof modules, a CAN bus, and more. Utilizes an STM32F4 processor to control the device and monitor its surroundings.",
        "date": "January 2023",
        "type": "Professional",
        "carousel": [],
        "id": "underwater-acoustic-pinger-v2",
        "link": "/projects/underwater-acoustic-pinger-v2"
    },
    {
        "title": "Open Source Programmable DC Electronic Load",
        "image": "/static/images/elec-load-1.png",
        "preview": "A PCB that is designed to test and verify the operation of power supplies and batteries.",
        "description": "A testing device that is meant to verify the operation of power supplies and batteries for long periods of time. Designed to be affordable and accessible to makers and hobbyists for future improvements. Plugs directly into a laptop or PC via USB-C and allows the user to control it via serial commands. Tracks the temperature of the Device Under Test (DUT), internal temperature, current drawn, load voltage, and total power consumption. Controls its own fans to cool the PCB and the load resistors. Allows the user to set constant current, constant voltage, and constant power modes for a variety of testing procedures. ",
        "date": "January 2023",
        "type": "Professional",
        "carousel": [],
        "id": "open-source-programmable-dc-electronic-load",
        "link": "/projects/open-source-programmable-dc-electronic-load"
    },
    {
        "title": "ECE 499 Capstone Project: Blood Pressure Emulator",
        "image": "/static/images/Capstone-Project.jpg",
        "preview": "A custom built Blood Pressure Emulator for testing new medical devices.",
        "description": "Worked with Salyx Medical to develop a custom Blood Pressure Emulator to test their Vitals Monitoring device. A custom built PCB was designed to receive feedback from flow and pressure sensors while driving two peristaltic pumps via stepper motor drivers. Led the design of the mechanical system to safely house all the electronics, tubing, and motors. Assisted with the development of the artifical limb and the testing of the PCB as well.",
        "date": "August 2022",
        "type": "Professional",
        "carousel": [
            "/static/images/Capstone-Project.jpg",
            "/static/images/Capstone-Group-Photo.jpg"
        ],
        "id": "ece-499-capstone-project:-blood-pressure-emulator",
        "link": "/projects/ece-499-capstone-project:-blood-pressure-emulator"
    },
    {
        "title": "Ergonomyx Automated Battery Testing Jig",
        "image": "/static/images/battery-tester-top.png",
        "preview": "A fully automated Battery Testing Jig to test 2 LIR2450s simultaneously.",
        "description": "Designed and programmed an automated battery tester to test LIR2450 batteries for Ergonomyx. The tester integrated a battery charging IC to charge the battery and a programmable load to set the discharge current of both batteries. Then when testing begins, the device charges the batteries to full and when charge is complete, begins discharging both batteries through the load resistors. This tester would automatically monitor the discharge current, discharge cycles, battery voltage, battery temperature, and the discharge time of both batteries and store all the data in a micro SD card. After testing is complete, the data on the micro SD card can be outputted to an excel sheet for further analysis.",
        "date": "July 2022",
        "type": "Professional",
        "carousel": [
            "/static/images/battery-tester-top.png",
            "/static/images/battery-tester-assembled.jpg",
            "/static/images/battery-tester-voltage.png",
            "/static/images/battery-tester-temperature.png"
        ],
        "id": "ergonomyx-automated-battery-testing-jig",
        "link": "/projects/ergonomyx-automated-battery-testing-jig"
    },
    {
        "title": "USV Custom LiOn Battery Design",
        "image": "/static/images/USV-LiOn-Battery.png",
        "preview": "A Lithium Ion battery pack made of 21700 cells alongside a BMS",
        "description": "Custom built a Lithium Ion battery pack made of 21700 cells. Configured as a 6S 9P battery, these batteries were chosen for their high power density and easy rechargability. A BMS integrated overcurrent, reverse voltage, and temperature protection features into the overall design of the battery pack.",
        "date": "June 2022",
        "type": "Professional",
        "carousel": [
            "/static/images/USV-LiOn-Battery.png",
            "/static/images/usv-lion-battery-1.jpg",
            "/static/images/usv-lion-battery-2.jpg"
        ],
        "id": "usv-custom-lion-battery-design",
        "link": "/projects/usv-custom-lion-battery-design"
    },
    {
        "title": "USV 5V Power Supply",
        "image": "/static/images/5V-Buck-PCB.png",
        "preview": "UVEEC's custom built 5V Buck Regulator",
        "description": "Designed and extensively tested the USV's 5V Buck Regulator. Soldered and tested it to ensure it's load regulating functionality at the expected load scenarios it will encounter on the USV. Studied the output with an oscilloscope to verify the output ripple voltage. Calculated the efficiency of the buck throughout multiple voltages. Also tested its Power Good output and Enable feature to ensure full functionality.",
        "date": "January 2022",
        "type": "Professional",
        "carousel": [],
        "id": "usv-5v-power-supply",
        "link": "/projects/usv-5v-power-supply"
    },
    {
        "title": "USV Power Distribution Board",
        "image": "/static/images/Power-Board-PCB.jpg",
        "preview": "A power distribution board to power UVEEC's Unmanned Surface water Vehicle (USV)",
        "description": "Designed a power distribution board to power and monitor UVEEC's Unmanned Surface water Vehicle (USV). This power board contains multiple voltage regulators to handle high amounts of current and steps down a 6S battery to 3V3, 5V, 7V4, and 12V rails for powering devices across the USV. It integrates important protection features such as overcurrent, emergency shutoff, reverse voltage, and ESD protection. The power board also keeps track of every power line to monitor the power drawn across the USV and can shut down any device when battery is running low.",
        "date": "December 2021",
        "type": "Professional",
        "carousel": [
            "/static/images/Power-Board-PCB.jpg",
            "/static/images/power-board-1.jpg",
            "/static/images/power-board-2.jpg"
        ],
        "id": "usv-power-distribution-board",
        "link": "/projects/usv-power-distribution-board"
    },
    {
        "title": "Ergonomyx Production Optimization",
        "image": "/static/images/Manufacturing-Stock-Photo.jpg",
        "preview": "Optimized the manufacturing of desk and bike PCBs at Ergonomyx Technologies",
        "description": "Optimized the manufacturing of desk and bike PCBAs by communicating Ergonomyx's needs with a multitude of PCB manufacturers. Redesigned each product's PCBs to integrate mechanical requirements and ensure easier assembly.",
        "date": "March 2021",
        "type": "Professional",
        "carousel": [],
        "id": "ergonomyx-production-optimization",
        "link": "/projects/ergonomyx-production-optimization"
    },
    {
        "title": "USB A/C Charging PCB",
        "image": "/static/images/USB-Stock-Photo.jpg",
        "preview": "A USB-A/C charging PCB to harvest Ergonomyx's Under the Desk Bike energy",
        "description": "Designed and prototyped a USB-A/C charging PCB that can convert Ergonomyx's Under Desk Bike harvested energy to charge a phone or tablet.",
        "date": "November 2020",
        "type": "Professional",
        "carousel": [],
        "id": "usb-ac-charging-pcb",
        "link": "/projects/usb-ac-charging-pcb"
    },
    {
        "title": "Ergonomyx Research and Development",
        "image": "/static/images/Ergonomyx-Bike.jpg",
        "preview": "Applied different methods of reducing acoustic noise for Ergonomyx's Under Desk Bike",
        "description": "Researched different methods of reducing the acoustic noise generated by filtering capacitors. Conducted numerous acoustic tests to compare tantalum, aluminum polymer, and ceramic capacitors to find out which capacitor reduced the noise generated by the Under the Desk Bike.",
        "date": "September 2020",
        "type": "Professional",
        "carousel": [],
        "id": "ergonomyx-research-and-development",
        "link": "/projects/ergonomyx-research-and-development"
    },
    {
        "title": "Railgun Control Board",
        "image": "/static/images/Railgun-Control-Board.png",
        "preview": "AUVIC's Railgun Control Board to control AUVIC's torpedo launchers",
        "description": "Designed and prototyped AUVIC's Railgun Control Board. This board was constructed to power and control the launch process of AUVIC's magnetic torpedo launcher for competing in RoboSub.",
        "date": "May 2020",
        "type": "Professional",
        "carousel": [
            "/static/images/Railgun-Control-Board.png",
            "/static/images/railgun-1.jpg",
            "/static/images/railgun-2.jpg"
        ],
        "id": "railgun-control-board",
        "link": "/projects/railgun-control-board"
    },
    {
        "title": "MIC Control Board",
        "image": "/static/images/MIC-Control-Board.jpg",
        "preview": "A custom PCB to control a 3D printed quadcopter",
        "description": "Design of a custom built Arduino based quadcopter control board. This PCB was designed to distrubute the power from an 11.1V Lipo battery to 4 Electronic Speed Controllers (ESCs) and 1 stepper motor. In addition to that, the PCB utilizes RF communication alongside a gyroscope and altimeter.",
        "date": "April 2020",
        "type": "Professional",
        "carousel": [],
        "id": "mic-control-board",
        "link": "/projects/mic-control-board"
    },
    {
        "title": "Vector CANoe Automated Functional Testing",
        "image": "/static/images/Vector-CANOE.jpg",
        "preview": "Automated functional testing for all Dometic devices",
        "description": "Updated a custom Communication Application Protocol Language (CAPL) CAN Calibration Protocol (CCP) system that utilized Vector's CANoe to automate functional testing on Dometic devices. This system was previously made for one specific Dometic product, but was updated to be easily configured for every Dometic device, current and future. ",
        "date": "February 2020",
        "type": "Professional",
        "carousel": [],
        "id": "vector-canoe-automated-functional-testing",
        "link": "/projects/vector-canoe-automated-functional-testing"
    },
    {
        "title": "Underwater Pinger",
        "image": "/static/images/Pinger-PCB.jpg",
        "preview": "A custom PCB to mimic the functions of an acoustic underwater pinger",
        "description": "A custom-built boost converter designed in conjuction with the AUVIC electrical team to mimic the functions of the Benthos ALP-365, an acoustic underwater pinger used in the RoboSub competition",
        "date": "June 2019",
        "type": "Professional",
        "carousel": [],
        "id": "underwater-pinger",
        "link": "/projects/underwater-pinger"
    },
    {
        "title": "Nickel Cadmium Charger",
        "image": "/static/images/Charger-PCB.jpg",
        "preview": "Custom built a nickel cadmium charger to charge the battery for an underwater pinger ",
        "description": "Design of a custom-built Nickel Cadmium Charger for powering an underwater pinger. The usb powered charging circuit contains a voltage regulator that outputs 3 volts with 200 mA of current, and a red and green LED that indicated charging state and completion",
        "date": "March 2019",
        "type": "Professional",
        "carousel": [],
        "id": "nickel-cadmium-charger",
        "link": "/projects/nickel-cadmium-charger"
    },
    {
        "title": "3D Printed Props",
        "image": "/static/images/captain-rex.jpg",
        "preview": "Some 3D printed props I painted and weathered",
        "description": "3D printed and painted my own set of props from my favorite TV shows, movies, and video games. Some examples are props from the Mandalorian, Apex Legends, and Star Wars: The Clone Wars. ",
        "date": "August 2022",
        "type": "Personal",
        "carousel": [
            "/static/images/captain-rex.jpg",
            "/static/images/bloodhound.jpg",
            "/static/images/mando.jpg",
            "/static/images/kylo-ren.jpg",
            "/static/images/mando-gun.jpg",
            "/static/images/fives.jpg"
        ],
        "id": "3d-printed-props",
        "link": "/projects/3d-printed-props"
    },
    {
        "title": "3D Printed Designs",
        "image": "/static/images/Yeti-Mug-CAD.png",
        "preview": "Examples of 3D printed objects I designed and prototyped",
        "description": "Designed 3D printed objects to solve a problem in my daily life. Some examples of this are the Yeti Rambler Handle and a dual spool holder for my 3D printer.",
        "date": "August 2022",
        "type": "Personal",
        "carousel": [
            "/static/images/Yeti-Mug-CAD.png",
            "/static/images/Yeti-Mug-Printed.jpg",
            "/static/images/Dual-Spool-Holder-CAD.png",
            "/static/images/Dual-Spool-Holder-printed.jpg"
        ],
        "id": "3d-printed-designs",
        "link": "/projects/3d-printed-designs"
    },
    {
        "title": "Anycubic I3 Mega Modifications",
        "image": "/static/images/Anycubic-1.jpg",
        "preview": "A variety of upgrades to the Anycubic I3 Mega from supporting all metal hotends to replacing its motherboard and stepper motor drivers.",
        "description": "Upgraded the hotend of my Anycubic I3 Mega to support an E3D all metal hotend for more stable temperature control and higher printing temperatures. Added lighting to the printer and replaced all the fans to Noctua fans for more silent printing. Replaced the motherboard and stepper motor drivers for faster printing and higher printing resolution. Replaced the original Bowden extruder with a direct drive system to increase extrusion reliability, lessen retractions, incorporate a wider range of filaments, and to print faster. ",
        "date": "June 2020",
        "type": "Personal",
        "carousel": [
            "/static/images/Anycubic-1.jpg",
            "/static/images/Anycubic-2.jpg",
            "/static/images/Anycubic-3.jpg"
        ],
        "id": "anycubic-i3-mega-modifications",
        "link": "/projects/anycubic-i3-mega-modifications"
    },
    {
        "title": "Voron 2.4 Build",
        "image": "/static/images/Voron-16.jpg",
        "preview": "An uncompromising large format 3D printer with a core XY belting system for high accuracy and fast printing speeds. ",
        "description": "Built and assembled my own 350mm cubed Voron 2.4. Hand wired all the electronics, routed the cables, and custom made my own wiring harnesses. 3D printed the necessary parts and further upgrades. Upgraded its hotend to support different types of nozzle sizes easily and to have RGB LED lighting. Added chamber lighting and custom Klipper macros to optimize printing setup. Currently working on making the gantry lighter by optimizing the gantry's steel rails while adding a CAN bus to the entire system to reduce wires.",
        "date": "December 2022",
        "type": "Personal",
        "carousel": [
            "/static/images/Voron-1.jpg",
            "/static/images/Voron-2.jpg",
            "/static/images/Voron-3.jpg",
            "/static/images/Voron-4.jpg",
            "/static/images/Voron-5.jpg",
            "/static/images/Voron-6.jpg",
            "/static/images/Voron-7.jpg",
            "/static/images/Voron-8.jpg",
            "/static/images/Voron-9.jpg",
            "/static/images/Voron-10.jpg",
            "/static/images/Voron-11.jpg",
            "/static/images/Voron-12.jpg",
            "/static/images/Voron-13.jpg",
            "/static/images/Voron-14.jpg",
            "/static/images/Voron-15.jpg",
            "/static/images/Voron-16.jpg"
        ],
        "id": "voron-2.4-build",
        "link": "/projects/voron-2.4-build"
    },
    {
        "title": "3D Printer Setups",
        "image": "/static/images/printing-setup-4.jpg",
        "preview": "A 3D printing shelf/enclosure to house my 3D printers cleanly and efficiently.",
        "description": "Initially, I created my own shelves to house both my Anycubic I3 Mega and Prusa I3 MK3S. This was done to save space in my house but to also make it easier to maintain both printers. Later when I was starting to print ABS, PC, and Nylon parts I wanted an enclosure to reduce the fumes coming out from my printer. Then I decided to upgrade to an Ikea Lack system that used raspberry Pis to add Wifi to both of my printers. I also custom made my own touchscreen housing to house a 7 inch touchscreen controlling my Prusa I3 MK3S in its enclosure. Extra storage was added with drawers along the top of the Lack setup.",
        "date": "June 2022",
        "type": "Personal",
        "carousel": [
            "/static/images/printing-setup-1.jpg",
            "/static/images/printing-setup-2.jpg",
            "/static/images/printing-setup-3.jpg",
            "/static/images/printing-setup-4.jpg"
        ],
        "id": "3d-printer-setups",
        "link": "/projects/3d-printer-setups"
    }
]