[
    {
        "title": "PCB Design Experience",
        "description": "Currently building a Smart Power Distribution Board that was designed to power the USV's electronics (BLDC motors, Central Controller Board, Raspberry Pi, etc.) while protecting against reverse voltage and overcurrent faults. The power drawn by external electronics were also measured alongside the health and status of the battery’s cells. An emergency shutdown feature was also implemented to manually shutdown the entire USV with one click of a button.",
        "image": "/static/images/Power-Board-PCB.jpg"
    },
    {
        "title": "Rapid Prototyping Skills",
        "description": "Utilized multiple 3D printers (Prusa I3 MK3S+ and Anycubic I3 Mega) to quickly prototype CAD designs in PETG, PLA, TPU, ASA, and other materials. These CAD designs were modelled within SolidWorks.",
        "image": "/static/images/printing-setup.jpg"
    },
    {
        "title": "Teamwork & Communication",
        "description": "Collaborated with diverse engineering and non-engineering teams to develop creative solutions to complex problems.",
        "image": "/static/images/UVEEC-Team-Photo.jpg"
    },
    {
        "title": "Diverse Problem Solving Skills",
        "description": "Conducted numerous acoustic tests to compare tantalum, aluminum, polymer, and ceramic capacitors to reduce the noise generated by Ergonomyx's Under the Desk Bike.",
        "image": "/static/images/ergo-stock.webp"
    },
    {
        "title": "Programming",
        "description": "Created custom scripts various projects, in C, C++ and Python. Developed firmware for a variety of microcontrollers such as the STM32 and ESP32 using the ESP IDF and STM32 Cube.",
        "image": "/static/images/programming-stock.webp"
    },
    {
        "title": "Leadership",
        "description": "Led a team of four to design a minimum viable product for a Universal Smart Desk Controller that can control any type of existing motorized sit stand desk at Ergonomyx Technologies.",
        "image": "/static/images/lead.jpg"
    }
]