[

    {
        "title": "USV Custom LiOn Battery Design",
        "image": "../static/images/USV-LiOn-Battery.png",
        "preview": "Custom built a Lithium Ion battery pack made of 21700 cells",
        "description": "Custom built a Lithium Ion battery pack made of 21700 cells. Configured as a 6S 9P battery, these batteries were chosen for their power density and rechargability. With a BMS for each battery pack, each individual pack integrated overcurrent, reverse voltage, and temperature protection features.",
        "date": "June 2022"
    },

    {
        "title": "USV 5V Power Supply",
        "image": "../static/images/5V-Buck-PCB.png",
        "preview": "Designed and prototyped the USV's 5V Buck Regulator",
        "description": "Designed and prototyped the USV's 5V Buck Regulator. Soldered and tested it to ensure it's load regulating functionality at the expected load scenarios it will encounter on the USV. Studied the output with an oscilloscope to verify the output ripple voltage. Calculated the efficiency of the buck throughout multiple voltages. Also tested its Power Good output and Enable feature to ensure full functionality.",
        "date": "January 2022"
    },

    {
        "title": "USV Power Distribution Board",
        "image": "../static/images/Power-Board-PCB.jpg",
        "preview": "Designed a power board distribution board to power the UVEEC's Unmanned Surface water Vehicle (USV)",
        "description": "Designed a power board distribution board to power the UVEEC's Unmanned Surface water Vehicle (USV). This power board contains multiple voltage regulators to handle high amounts of current and steps down a 6S battery to 3V3, 5V, 7V4, and 12V rails for powering devices across the USV. It integrates important protection features such as overcurrent, emergency shutoff, reverse voltage, and ESD protection. The power board also keeps track of every power line to monitor the power drawn across the USV and can shut down any device when battery is running low.",
        "date": "December 2021"
    },

    {
        "title": "Ergonomyx Production Optimization",
        "image": "../static/images/Manufacturing-Stock-Photo.jpg",
        "preview": "",
        "description": "Optimized the manufacturing of desk and bike PCBAs by communicating Ergonomyx's needs with a multitude of PCB manufacturers. Redesigned each product's PCBs to integrate mechanical requirements and ensure easier assembly.",
        "date": "March 2021"
    },

    {
        "title": "USB A/C Charging PCB",
        "image": "../static/images/USB-Stock-Photo.jpg",
        "preview": "",
        "description": "Designed and prototyped a USB-A/C charging PCB that can convert Ergonomyx's Under Desk Bike harvested energy to charge a phone or tablet.",
        "date": "November 2020"
    },

    {
        "title": "Ergonomyx Research and Development",
        "image": "../static/images/Ergonomyx-Bike.jpg",
        "preview": "",
        "description": "Researched different methods of reducing the acoustic noise generated by filtering capacitors. Conducted numerous acoustic tests to compare tantalum, aluminum polymer, and ceramic capacitors to find out which capacitor reduced the noise generated by the Under the Desk Bike.",
        "date": "September 2020"
    },

    {
        "title": "Railgun Control Board",
        "image": "../static/images/Railgun-Control-Board.png",
        "preview": "",
        "description": "Designed and soldered AUVIC's Railgun Control Board. This board was constructed to power and control the launch process of AUVIC's magnetic torpedo launcher for competing in RoboSub.",
        "date": "May 2020"
    },

    {
        "title": "MIC Control Board",
        "image": "../static/images/MIC-Control-Board.jpg",
        "preview": "",
        "description": "Design of a custom built Arduino based quadcopter control board. This PCB was designed to distrubute the power from an 11.1V Lipo battery to 4 Electronic Speed Controllers (ESCs) and 1 stepper motor. In addition to that, the PCB utilizes RF communication alongside a gyroscope and altimeter.",
        "date": "April 2020"
    },

    {
        "title": "Vector CANoe Automated Functional Testing",
        "image": "../static/images/Vector-CANOE.jpg",
        "preview": "",
        "description": "Updated a custom Communication Application Protocol Language (CAPL) CAN Calibration Protocol (CCP) system that utilized Vector's CANoe to automate functional testing on Dometic devices. This system was previously made for one specific Dometic product, but was updated to be easily configured for every Dometic device, current and future. ",
        "date": "February 2020"
    },

    {
        "title": "Underwater Pinger",
        "image": "../static/images/Pinger-PCB.jpg",
        "preview": "",
        "description": "A custom-built boost converter designed in conjuction with the AUVIC electrical team to mimic the functions of the Benthos ALP-365, an acoustic underwater pinger used in the RoboSub competition",
        "date": "June 2019"
    },

    {
        "title": "Nickel Cadmium Charger",
        "image": "../static/images/Charger-PCB.jpg",
        "preview": "",
        "description": "Design of a custom-built Nickel Cadmium Charger for powering an underwater pinger. The usb powered charging circuit contains a voltage regulator that outputs 3 volts with 200 mA of current, and a red and green LED that indicated charging state and completion",
        "date": "March 2019"
    }
]